In [1]:
import pandas as pd
from sqlalchemy import create_engine, text
from private_info import POSTGRES_PW
from sqlalchemy.exc import SQLAlchemyError

In [2]:
db_url = f"postgresql+psycopg2://postgres:{POSTGRES_PW}@localhost:5432/ecom_analysis"

In [3]:
engine = create_engine(db_url)

In [4]:
check_tables_query = """
SELECT table_name 
FROM information_schema.tables 
WHERE table_schema = 'public' 
AND table_name IN ('orders', 'products', 'order_products', 'aisles', 'departments');
"""

with open('data_modelling/QuickDBD-ecom_erd_model.sql', 'r', encoding='utf-8-sig') as file:
    table_create_query = file.read()
    
with engine.begin() as connection:
    results = [x for x in connection.execute(text(check_tables_query))]
    if len(results):
        print('Tables already exist.')
    else:
        print('No tables found, proceeding with table creation.')
        try:
            for query in table_create_query.split(';'):
                if query.strip():
                    connection.execute(text(query))
                    print('query executed.')
                else:
                    print(f'This query {repr(query)}, is whitepsace.')
                    
            print('Executed table creation query from sql file.')
        except SQLAlchemyError as e:
            print(f'Unable to execute query: {str(e)}')

No tables found, proceeding with table creation.
query executed.
query executed.
query executed.
query executed.
query executed.
query executed.
query executed.
query executed.
query executed.
This query '', is whitepsace.
Executed table creation query from sql file.

In [5]:
aisles_df = pd.read_csv('resources/aisles.csv')
dept_df = pd.read_csv('resources/departments.csv')
order_prod_df = pd.read_csv('resources/order_products.csv')
orders_df = pd.read_csv('resources/orders.csv')
prod_df = pd.read_csv('resources/products.csv')

In [6]:
def load_table(dataframe, table: str, engine) -> str:
    """
    Load the dataframe into the specified database table.

    Args:
        dataframe (DataFrame): The dataframe to load.
        table (str): The name of the table to load the data into.
        engine (Engine): The SQLAlchemy engine for connecting to the database.

    Returns:
        str: A success message indicating that the table was loaded to the database.
    """
    dataframe.to_sql(table, con=engine, index = False, if_exists ='append')
    return f'{table} loaded to database.'

In [7]:
aisles_df.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [8]:
load_table(aisles_df, 'aisles', engine)

'aisles loaded to database.'

In [9]:
dept_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [10]:
load_table(dept_df, 'departments', engine)

'departments loaded to database.'

In [13]:
order_prod_df.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [17]:
load_table(order_prod_df, 'order_products', engine)

'order_products loaded to database.'

In [14]:
orders_df.head()
orders_df.drop(columns=['eval_set'], inplace=True)

In [15]:
orders_df.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [16]:
load_table(orders_df, 'orders', engine)

'orders loaded to database.'

In [11]:
prod_df.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [12]:
load_table(prod_df, 'products', engine)

'products loaded to database.'